burakenez/gd32f527-cmake-vscode/Examples/I2C/I2C3_Slave_receiver/Application/Core/Src/main.c
/*!
    \file    main.c
    \brief   slave receiver

    \version 2026-01-31, V1.4.0, firmware for GD32F527
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include <stdio.h>
#include "gd32f527i_eval.h"
#include "gd32f527.h"

#define I2C3_OWN_ADDRESS7      0x82

uint8_t i2c_receiver[16];

void rcu_config(void);
void i2c_gpio_config(void);
void i2c_config(void);

/*!
    \brief      main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void)
{
    int i;

    /* configure USART */
    gd_eval_com_init(EVAL_COM0);
    printf("\r\n I2C Start\r\n");
    /* enable the peripheral clock */
    rcu_config();
    /* configure the I2C GPIO ports */
    i2c_gpio_config();
    /* configure I2C */
    i2c_config();

    i = 0;
    /* wait until ADDSEND bit is set */
    while(!i2c_add_flag_get(I2C3, I2C_ADD_FLAG_ADDSEND));
    /* clear ADDSEND bit */
    i2c_add_flag_clear(I2C3, I2C_ADD_FLAG_ADDSEND);
    for(i = 0; i < 16; i++) {
        /* wait until the RBNE bit is set */
        while(!i2c_add_flag_get(I2C3, I2C_ADD_FLAG_RBNE));
        /* read a data byte from I2C_RDATA */
        i2c_receiver[i] = i2c_add_data_receive(I2C3);
    }
    /* wait until the STPDET bit is set */
    while(!i2c_add_flag_get(I2C3, I2C_ADD_FLAG_STPDET));
    /* clear the STPDET bit */
    i2c_add_flag_clear(I2C3, I2C_ADD_FLAG_STPDET);
    for(i = 0; i < 16; i++) {
        printf("0x%02X ", i2c_receiver[i]);
    }
    while(1) {
    }
}

/*!
    \brief      enable the peripheral clock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void rcu_config(void)
{
    /* enable GPIOF clock */
    rcu_periph_clock_enable(RCU_GPIOF);
    /* enable I2C3 clock */
    rcu_periph_clock_enable(RCU_I2C3);
}

/*!
    \brief      configure the I2C3 GPIO ports
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_gpio_config(void)
{
    /* connect PF14 to I2C_SCL */
    gpio_af_set(GPIOF, GPIO_AF_4, GPIO_PIN_14);
    /* connect PF15 to I2C_SDA */
    gpio_af_set(GPIOF, GPIO_AF_4, GPIO_PIN_15);
    /* configure GPIO pins of I2C */
    gpio_mode_set(GPIOF, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_14);
    gpio_output_options_set(GPIOF, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_14);
    gpio_mode_set(GPIOF, GPIO_MODE_AF, GPIO_PUPD_PULLUP, GPIO_PIN_15);
    gpio_output_options_set(GPIOF, GPIO_OTYPE_OD, GPIO_OSPEED_50MHZ, GPIO_PIN_15);
}

/*!
    \brief      configure the I2C3 interface
    \param[in]  none
    \param[out] none
    \retval     none
*/
void i2c_config(void)
{
    /* configure I2C timing */
    i2c_add_timing_config(I2C3, 0, 0x5, 0);
    /* configure I2C address */
    i2c_add_address_config(I2C3, I2C3_OWN_ADDRESS7, I2C_ADD_ADDFORMAT_7BITS);
    /* enable I2C3 */
    i2c_add_enable(I2C3);
}

